Австралия/src/Documents/DirectDebit/DirectDebit.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>DirectDebit</name>
  <basedOn>Document.SalesInvoice</basedOn>
  <basedOn>Catalog.CounterpartyContracts</basedOn>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentConfirmationStatus</name>
    <type>
      <types>EnumRef.PaymentApprovalStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Mandate</name>
    <type>
      <types>CatalogRef.DirectDebitMandates</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentPurpose</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SequenceType</name>
    <type>
      <types>EnumRef.DirectDebitSequenceTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PaymentDetails</name>
    <attributes>
      <name>Contract</name>
      <type>
        <types>CatalogRef.CounterpartyContracts</types>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.SalesInvoice</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>CatalogRef.VATRates</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/InformationRegisters/AccountingPolicy/AccountingPolicy.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AccountingPolicy</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>RegisteredForVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostVATEntriesBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostAdvancePaymentsBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>IssueAutomaticallyAgainstSales</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DefaultVATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </resources>
  <resources>
    <name>CashMethodOfAccounting</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryValuationMethod</name>
    <type>
      <types>EnumRef.InventoryValuationMethods</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnFromCustomer</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnToSupplier</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>StockTransactionsMethodology</name>
    <type>
      <types>EnumRef.StockTransactionsMethodology</types>
    </type>
  </resources>
  <resources>
    <name>PostExpensesByWorkOrder</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ManufacturingOverheadsAllocationMethod</name>
    <type>
      <types>EnumRef.ManufacturingOverheadsAllocationMethods</types>
    </type>
  </resources>
  <resources>
    <name>InvoiceTotalDue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>AccountBalance</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>Overdue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>VATRoundingRule</name>
    <type>
      <types>EnumRef.VATRoundingRules</types>
    </type>
  </resources>
  <resources>
    <name>RegisteredForSalesTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UnderOverAllocatedOverheadsSetting</name>
    <type>
      <types>EnumRef.UnderOverAllocatedOverheadsSettings</types>
    </type>
  </resources>
  <resources>
    <name>RegisterDeliveryDateInInvoices</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryDispatchingStrategy</name>
    <type>
      <types>EnumRef.InventoryDispatchingStrategy</types>
    </type>
  </resources>
  <resources>
    <name>AccountingPrice</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </resources>
  <resources>
    <name>UseTemplates</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>RegisterAccountingEntries</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/DirectDebitSequenceTypes/DirectDebitSequenceTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>DirectDebitSequenceTypes</name>
  <enumValues>
    <name>OOFF</name>
  </enumValues>
  <enumValues>
    <name>RCUR</name>
  </enumValues>
  <enumValues>
    <name>FNAL</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/CounterpartyContractStatuses/CounterpartyContractStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CounterpartyContractStatuses</name>
  <enumValues>
    <name>NotAgreed</name>
  </enumValues>
  <enumValues>
    <name>Active</name>
  </enumValues>
  <enumValues>
    <name>Closed</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/PaymentMethods/PaymentMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>PaymentMethods</name>
  <predefined>
    <items>
      <name>Cash</name>
      <description>Cash</description>
    </items>
    <items>
      <name>DirectDebit</name>
      <description>Direct debit</description>
    </items>
    <items>
      <name>Electronic</name>
      <description>Electronic</description>
    </items>
    <items>
      <name>Undefined</name>
      <description>Undefined</description>
    </items>
  </predefined>
  <attributes>
    <name>CashAssetType</name>
    <type>
      <types>EnumRef.CashAssetTypes</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Documents/DirectDebit/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

// Procedure - event handler "Posting".
//
Procedure Posting(Cancel, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	// Initialization of additional properties for document posting
	DriveServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Preparation of record sets
	DriveServer.PrepareRecordSetsForRecording(ThisObject);
	
	
	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
	
EndProcedure

Procedure ChangeMandateType(WriteMode)
	If Mandate.IsEmpty() Then
		Return;
	EndIf;
	
	// change mandate type 
	NewStatus = Mandate.MandateStatus;
	NewSequenceType = Mandate.DirectDebitSequenceType;
	
	If WriteMode = DocumentWriteMode.Posting Then
		If Mandate.DirectDebitSequenceType = Enums.DirectDebitSequenceTypes.OOFF Then
			NewStatus = Enums.CounterpartyContractStatuses.Closed;
		Else
			If SequenceType = Enums.DirectDebitSequenceTypes.RCUR Then
				// if this was final payment and now it is next - return mandate to next
				NewStatus = Enums.CounterpartyContractStatuses.Active;
				NewSequenceType = Enums.DirectDebitSequenceTypes.RCUR;
			ElsIf SequenceType = Enums.DirectDebitSequenceTypes.FNAL Then
				// if this was final payment -set mandate to FNAL
				NewStatus = Enums.CounterpartyContractStatuses.Closed;
				NewSequenceType = Enums.DirectDebitSequenceTypes.FNAL;
			EndIf
		EndIf;		
	ElsIf WriteMode = DocumentWriteMode.UndoPosting Then
		// if this was final payment - return mandate to next
		NewStatus = Enums.CounterpartyContractStatuses.Active;
		If Mandate.DirectDebitSequenceType <> Enums.DirectDebitSequenceTypes.OOFF Then
			NewSequenceType = Enums.DirectDebitSequenceTypes.RCUR;
		EndIf;
	EndIf;
	
	If NewStatus <> Mandate.MandateStatus Then
		Man = Mandate.GetObject();
		Man.DirectDebitSequenceType = NewSequenceType;
		Man.MandateStatus = NewStatus;
		Man.Write();
	EndIf;

EndProcedure

Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;

	ChangeMandateType(WriteMode);
EndProcedure

Procedure Filling(FillingData, StandardProcessing)
	If TypeOf(FillingData) = Type("DocumentRef.SalesInvoice") Then
		PaymentPurpose = StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en='Invoice #%1 dated %2'; ru = 'Инвойс №%1 от %2';pl = 'Faktura nr %1 z dnia %2';es_ES = 'Factura #%1 fechada %2';es_CO = 'Factura #%1 fechada %2';tr = '%1 sayılı, %2 tarihli fatura';it = 'Fattura #%1 datata %2';de = 'Rechnung Nr. %1 vom %2'"),
			FillingData.Number,
			Format(FillingData.Date,NStr("en = 'dd.MM.yyyy'; ru = 'дд.ММ.гггг';pl = 'dd.MM.yyyy';es_ES = 'dd.MM.aaaa';es_CO = 'dd.MM.aaaa';tr = 'gg.AA.yyyy';it = 'dd/MM/yyyy';de = 'dd.MM.yyyy'")));
		PaymentDate = CurrentSessionDate();
		Author = SessionParameters.CurrentUser;
		BankAccount = FillingData.BankAccount;
		Comment = FillingData.Comment;
		Company = FillingData.Company;
		Counterparty = FillingData.Counterparty;
		CounterpartyAccount = FillingData.CounterpartyBankAcc;
		DocumentAmount = FillingData.DocumentAmount;
		DocumentCurrency = FillingData.DocumentCurrency;
		PaymentDate = CurrentSessionDate();
		Mandate = FillingData.DirectDebitMandate;
		SequenceType = Mandate.DirectDebitSequenceType;
		CounterpartyAccount = Mandate.BankAccount;
		If FillingData.PaymentCalendar.Count() > 0 Then
			PaymentDate = FillingData.PaymentCalendar[0].PaymentDate;
		EndIf;
		
		InvInfo = FillingData.Inventory.Unload();
		InvInfo.GroupBy("VATRate","VATAmount,Amount");
		For Each Det In InvInfo Do
			Ln = PaymentDetails.Add();
			Ln.Document = FillingData.Ref;
			Ln.Contract = Ln.Document.Contract;
			Ln.VATRate = Det.VATRate;
			Ln.VATAmount = Det.VATAmount;
			If Ln.Document.AmountIncludesVAT Then 
				Ln.PaymentAmount = Det.Amount;
			Else
				Ln.PaymentAmount = Det.Amount + Det.VATAmount;
			EndIf;
		EndDo;
	ElsIf TypeOf(FillingData) = Type("CatalogRef.CounterpartyContracts") Then
		If FillingData.PaymentMethod <> Catalogs.PaymentMethods.DirectDebit Then
			Return;
		EndIf;
			
		PaymentPurpose = StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en='Contract #%1 dated %2'; ru = 'Договор №%1 от %2';pl = 'Kontrakt nr %1 z dnia %2';es_ES = 'Contrato #%1 fechado %2';es_CO = 'Contrato #%1 fechado %2';tr = '#%1 tarihli %2 sözleşme';it = 'Contratto #%1 datato %2';de = 'Vertrag Nr. #%1 vom %2'"),
			FillingData.ContractNo,
			Format(FillingData.ContractDate,NStr("en = 'dd.MM.yyyy'; ru = 'дд.ММ.гггг';pl = 'dd.MM.yyyy';es_ES = 'dd.MM.aaaa';es_CO = 'dd.MM.aaaa';tr = 'gg.AA.yyyy';it = 'dd/MM/yyyy';de = 'dd.MM.yyyy'")));
		PaymentDate = CurrentSessionDate();
		Author = SessionParameters.CurrentUser;
		Comment = FillingData.Comment;
		Company = FillingData.Company;
		Counterparty = FillingData.Owner;
		
		DocumentCurrency = FillingData.SettlementsCurrency;
		PaymentDate = CurrentSessionDate();
		Mandate = FillingData.DirectDebitMandate;
		SequenceType = Mandate.DirectDebitSequenceType;
		CounterpartyAccount = Mandate.BankAccount;
		
		Ln = PaymentDetails.Add();
		Ln.Contract = FillingData.Ref;
		Ln.VATRate = InformationRegisters.AccountingPolicy.GetDefaultVATRate(CurrentSessionDate(), Company);

	EndIf;
EndProcedure

Procedure OnCopy(CopiedObject)
	Mandate = Undefined;
	SequenceType = Undefined;
EndProcedure

#EndRegion

#EndIf
